MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2H14F0AGV2000M/mcu.h
#define bFM_MFT1_ADCMP_ACMC4_MZCE                 *((volatile  uint8_t *)(0x42423CD8UL))
#define bFM4_MFT1_ADCMP_ACMC4_MZCE                *((volatile  uint8_t *)(0x42423CD8UL))
#define bFM_MFT1_ADCMP_ACMC4_MPCE                 *((volatile  uint8_t *)(0x42423CDCUL))
#define bFM4_MFT1_ADCMP_ACMC4_MPCE                *((volatile  uint8_t *)(0x42423CDCUL))

#define bFM_MFT1_ADCMP_ACMC5_MZCE                 *((volatile  uint8_t *)(0x42423D58UL))
#define bFM4_MFT1_ADCMP_ACMC5_MZCE                *((volatile  uint8_t *)(0x42423D58UL))
#define bFM_MFT1_ADCMP_ACMC5_MPCE                 *((volatile  uint8_t *)(0x42423D5CUL))
#define bFM4_MFT1_ADCMP_ACMC5_MPCE                *((volatile  uint8_t *)(0x42423D5CUL))

#define bFM_MFT1_ADCMP_ACSC0_APBM                 *((volatile  uint8_t *)(0x42423A94UL))
#define bFM4_MFT1_ADCMP_ACSC0_APBM                *((volatile  uint8_t *)(0x42423A94UL))

#define bFM_MFT1_ADCMP_ACSC1_APBM                 *((volatile  uint8_t *)(0x42423B14UL))
#define bFM4_MFT1_ADCMP_ACSC1_APBM                *((volatile  uint8_t *)(0x42423B14UL))

#define bFM_MFT1_ADCMP_ACSC2_APBM                 *((volatile  uint8_t *)(0x42423B94UL))
#define bFM4_MFT1_ADCMP_ACSC2_APBM                *((volatile  uint8_t *)(0x42423B94UL))

#define bFM_MFT1_ADCMP_ACSC3_APBM                 *((volatile  uint8_t *)(0x42423C14UL))
#define bFM4_MFT1_ADCMP_ACSC3_APBM                *((volatile  uint8_t *)(0x42423C14UL))

#define bFM_MFT1_ADCMP_ACSC4_APBM                 *((volatile  uint8_t *)(0x42423C94UL))
#define bFM4_MFT1_ADCMP_ACSC4_APBM                *((volatile  uint8_t *)(0x42423C94UL))

#define bFM_MFT1_ADCMP_ACSC5_APBM                 *((volatile  uint8_t *)(0x42423D14UL))
#define bFM4_MFT1_ADCMP_ACSC5_APBM                *((volatile  uint8_t *)(0x42423D14UL))

#define bFM_MFT1_ADCMP_ACSD0_AMOD                 *((volatile  uint8_t *)(0x42423AA0UL))
#define bFM4_MFT1_ADCMP_ACSD0_AMOD                *((volatile  uint8_t *)(0x42423AA0UL))
#define bFM_MFT1_ADCMP_ACSD0_OCUS                 *((volatile  uint8_t *)(0x42423AA4UL))
#define bFM4_MFT1_ADCMP_ACSD0_OCUS                *((volatile  uint8_t *)(0x42423AA4UL))
#define bFM_MFT1_ADCMP_ACSD0_DE                   *((volatile  uint8_t *)(0x42423AB0UL))
#define bFM4_MFT1_ADCMP_ACSD0_DE                  *((volatile  uint8_t *)(0x42423AB0UL))
#define bFM_MFT1_ADCMP_ACSD0_PE                   *((volatile  uint8_t *)(0x42423AB4UL))
#define bFM4_MFT1_ADCMP_ACSD0_PE                  *((volatile  uint8_t *)(0x42423AB4UL))
#define bFM_MFT1_ADCMP_ACSD0_UE                   *((volatile  uint8_t *)(0x42423AB8UL))
#define bFM4_MFT1_ADCMP_ACSD0_UE                  *((volatile  uint8_t *)(0x42423AB8UL))
#define bFM_MFT1_ADCMP_ACSD0_ZE                   *((volatile  uint8_t *)(0x42423ABCUL))
#define bFM4_MFT1_ADCMP_ACSD0_ZE                  *((volatile  uint8_t *)(0x42423ABCUL))

#define bFM_MFT1_ADCMP_ACSD1_AMOD                 *((volatile  uint8_t *)(0x42423B20UL))
#define bFM4_MFT1_ADCMP_ACSD1_AMOD                *((volatile  uint8_t *)(0x42423B20UL))
#define bFM_MFT1_ADCMP_ACSD1_OCUS                 *((volatile  uint8_t *)(0x42423B24UL))
#define bFM4_MFT1_ADCMP_ACSD1_OCUS                *((volatile  uint8_t *)(0x42423B24UL))
#define bFM_MFT1_ADCMP_ACSD1_DE                   *((volatile  uint8_t *)(0x42423B30UL))
#define bFM4_MFT1_ADCMP_ACSD1_DE                  *((volatile  uint8_t *)(0x42423B30UL))
#define bFM_MFT1_ADCMP_ACSD1_PE                   *((volatile  uint8_t *)(0x42423B34UL))
#define bFM4_MFT1_ADCMP_ACSD1_PE                  *((volatile  uint8_t *)(0x42423B34UL))
#define bFM_MFT1_ADCMP_ACSD1_UE                   *((volatile  uint8_t *)(0x42423B38UL))
#define bFM4_MFT1_ADCMP_ACSD1_UE                  *((volatile  uint8_t *)(0x42423B38UL))
#define bFM_MFT1_ADCMP_ACSD1_ZE                   *((volatile  uint8_t *)(0x42423B3CUL))
#define bFM4_MFT1_ADCMP_ACSD1_ZE                  *((volatile  uint8_t *)(0x42423B3CUL))

#define bFM_MFT1_ADCMP_ACSD2_AMOD                 *((volatile  uint8_t *)(0x42423BA0UL))
#define bFM4_MFT1_ADCMP_ACSD2_AMOD                *((volatile  uint8_t *)(0x42423BA0UL))
#define bFM_MFT1_ADCMP_ACSD2_OCUS                 *((volatile  uint8_t *)(0x42423BA4UL))
#define bFM4_MFT1_ADCMP_ACSD2_OCUS                *((volatile  uint8_t *)(0x42423BA4UL))
#define bFM_MFT1_ADCMP_ACSD2_DE                   *((volatile  uint8_t *)(0x42423BB0UL))
#define bFM4_MFT1_ADCMP_ACSD2_DE                  *((volatile  uint8_t *)(0x42423BB0UL))
#define bFM_MFT1_ADCMP_ACSD2_PE                   *((volatile  uint8_t *)(0x42423BB4UL))
#define bFM4_MFT1_ADCMP_ACSD2_PE                  *((volatile  uint8_t *)(0x42423BB4UL))
#define bFM_MFT1_ADCMP_ACSD2_UE                   *((volatile  uint8_t *)(0x42423BB8UL))
#define bFM4_MFT1_ADCMP_ACSD2_UE                  *((volatile  uint8_t *)(0x42423BB8UL))
#define bFM_MFT1_ADCMP_ACSD2_ZE                   *((volatile  uint8_t *)(0x42423BBCUL))
#define bFM4_MFT1_ADCMP_ACSD2_ZE                  *((volatile  uint8_t *)(0x42423BBCUL))

#define bFM_MFT1_ADCMP_ACSD3_AMOD                 *((volatile  uint8_t *)(0x42423C20UL))
#define bFM4_MFT1_ADCMP_ACSD3_AMOD                *((volatile  uint8_t *)(0x42423C20UL))
#define bFM_MFT1_ADCMP_ACSD3_OCUS                 *((volatile  uint8_t *)(0x42423C24UL))
#define bFM4_MFT1_ADCMP_ACSD3_OCUS                *((volatile  uint8_t *)(0x42423C24UL))
#define bFM_MFT1_ADCMP_ACSD3_DE                   *((volatile  uint8_t *)(0x42423C30UL))
#define bFM4_MFT1_ADCMP_ACSD3_DE                  *((volatile  uint8_t *)(0x42423C30UL))
#define bFM_MFT1_ADCMP_ACSD3_PE                   *((volatile  uint8_t *)(0x42423C34UL))
#define bFM4_MFT1_ADCMP_ACSD3_PE                  *((volatile  uint8_t *)(0x42423C34UL))
#define bFM_MFT1_ADCMP_ACSD3_UE                   *((volatile  uint8_t *)(0x42423C38UL))
#define bFM4_MFT1_ADCMP_ACSD3_UE                  *((volatile  uint8_t *)(0x42423C38UL))
#define bFM_MFT1_ADCMP_ACSD3_ZE                   *((volatile  uint8_t *)(0x42423C3CUL))
#define bFM4_MFT1_ADCMP_ACSD3_ZE                  *((volatile  uint8_t *)(0x42423C3CUL))

#define bFM_MFT1_ADCMP_ACSD4_AMOD                 *((volatile  uint8_t *)(0x42423CA0UL))
#define bFM4_MFT1_ADCMP_ACSD4_AMOD                *((volatile  uint8_t *)(0x42423CA0UL))
#define bFM_MFT1_ADCMP_ACSD4_OCUS                 *((volatile  uint8_t *)(0x42423CA4UL))
#define bFM4_MFT1_ADCMP_ACSD4_OCUS                *((volatile  uint8_t *)(0x42423CA4UL))
#define bFM_MFT1_ADCMP_ACSD4_DE                   *((volatile  uint8_t *)(0x42423CB0UL))
#define bFM4_MFT1_ADCMP_ACSD4_DE                  *((volatile  uint8_t *)(0x42423CB0UL))
#define bFM_MFT1_ADCMP_ACSD4_PE                   *((volatile  uint8_t *)(0x42423CB4UL))
#define bFM4_MFT1_ADCMP_ACSD4_PE                  *((volatile  uint8_t *)(0x42423CB4UL))
#define bFM_MFT1_ADCMP_ACSD4_UE                   *((volatile  uint8_t *)(0x42423CB8UL))
#define bFM4_MFT1_ADCMP_ACSD4_UE                  *((volatile  uint8_t *)(0x42423CB8UL))
#define bFM_MFT1_ADCMP_ACSD4_ZE                   *((volatile  uint8_t *)(0x42423CBCUL))
#define bFM4_MFT1_ADCMP_ACSD4_ZE                  *((volatile  uint8_t *)(0x42423CBCUL))

#define bFM_MFT1_ADCMP_ACSD5_AMOD                 *((volatile  uint8_t *)(0x42423D20UL))
#define bFM4_MFT1_ADCMP_ACSD5_AMOD                *((volatile  uint8_t *)(0x42423D20UL))
#define bFM_MFT1_ADCMP_ACSD5_OCUS                 *((volatile  uint8_t *)(0x42423D24UL))
#define bFM4_MFT1_ADCMP_ACSD5_OCUS                *((volatile  uint8_t *)(0x42423D24UL))
#define bFM_MFT1_ADCMP_ACSD5_DE                   *((volatile  uint8_t *)(0x42423D30UL))
#define bFM4_MFT1_ADCMP_ACSD5_DE                  *((volatile  uint8_t *)(0x42423D30UL))
#define bFM_MFT1_ADCMP_ACSD5_PE                   *((volatile  uint8_t *)(0x42423D34UL))
#define bFM4_MFT1_ADCMP_ACSD5_PE                  *((volatile  uint8_t *)(0x42423D34UL))
#define bFM_MFT1_ADCMP_ACSD5_UE                   *((volatile  uint8_t *)(0x42423D38UL))
#define bFM4_MFT1_ADCMP_ACSD5_UE                  *((volatile  uint8_t *)(0x42423D38UL))
#define bFM_MFT1_ADCMP_ACSD5_ZE                   *((volatile  uint8_t *)(0x42423D3CUL))
#define bFM4_MFT1_ADCMP_ACSD5_ZE                  *((volatile  uint8_t *)(0x42423D3CUL))

